---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationProductDataLongDescription
source: html/4f057bfd-a983-1d1b-a489-3c8d2b14a26b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationProductDataLongDescription Property

"Product Long Description"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationProductDataLongDescription { get; }
```